{
  "about": {
    "intro": "I am a Computer Science graduate from University of South Florida with a strong foundation in software engineering, cloud computing, and applied AI. I specialize in building intelligent, scalable systems that bridge automation, data, and user-centric design.",
    "experience": "With over 3 years of professional experience, I’ve worked across full-stack engineering, NLP research, and cloud-native infrastructure. My work spans designing distributed data workflows, building AI-powered applications, and deploying production systems on AWS and Kubernetes.",
    "goal": "I aim to work on impactful engineering problems at the intersection of software, cloud, and AI; contributing to scalable systems that empower users and drive innovation."
  },
  "skills": {
    "Languages": ["Python", "Java", "JavaScript"],
    "Frontend Development": ["React.js", "HTML", "CSS", "Vercel AI SDK"],
    "Frameworks & Libraries": ["Django", "Flask", "FastAPI", "Node.js", "Spring Boot", "JUnit 5", "Mockito"],
    "Cloud & DevOps": ["AWS (EKS, S3, RDS, EFS, EMR, Lambda, EC2, SageMaker, Bedrock)", "Terraform", "Apache Airflow", "Docker", "Kubernetes", "Jenkins"],
    "Databases": ["MySQL", "PostgreSQL", "MongoDB", "Redis", "Chroma", "FAISS"],
    "Machine Learning & NLP": ["NumPy", "Pandas", "Matplotlib", "Scikit-learn", "TensorFlow", "Keras", "PyTorch", "SpaCy", "Transformers", "LangChain", "ClinicalBERT", "LLMs"],
    "Developer & Collaboration Tools": ["Git", "Bitbucket", "JIRA", "Confluence", "Google Colab"]
  },
  "experience": [
    {
      "company": "Experian",
      "logo": "assets/img/experian-logo.png",
      "position": "Software Engineer",
      "period": "Oct 2024 - Present",
      "location": "Remote, USA",
      "responsibilities": [
        "Led end-to-end development for a centralized workflow automation platform on AWS using Apache Airflow, enabling 15+ teams to manage ETL pipelines and large-scale batch processing.",
        "Designed and implemented a cloud-native monitoring framework, reducing incident resolution time by 30%.",
        "Automated onboarding workflows, increasing operational efficiency by 50% and reducing manual dependencies.",
        "Migrated application architecture from EC2 to EKS (Kubernetes) for isolated, cost-efficient scaling.",
        "Technologies: Python, Docker, Kubernetes, Helm, Terraform, EMR, EKS, ECR, SQS, Spark, Java, Jenkins."
      ]
    },
    {
      "company": "University of South Florida - Department of Computer Science",
      "logo": "assets/img/usf-logo.png",
      "position": "Research Assistant",
      "period": "Aug 2024 - Jan 2025",
      "location": "Tampa, USA",
      "responsibilities": [
        "Developed an NLP pipeline to extract structured data from unstructured uterine cancer pathology reports using OCR.",
        "Built a transformer-based model to identify key medical entities and map them to ICD-10 codes.",
        "Developed a RAG-based clinical QA system using vector databases and React UI, reducing manual interpretation time by 60%.",
        "Technologies: Python, AWS Textract, SpaCy, Transformers, ClinicalBERT, LangChain, Chroma, FastAPI, SageMaker, Vercel AI SDK."
      ]
    },
    {
      "company": "Experian",
      "logo": "assets/img/experian-logo.png",
      "position": "Software Engineer",
      "period": "Sep 2021 - Jul 2023",
      "location": "Hyderabad, India",
      "responsibilities": [
        "Developed an automated malware scanning service for external files, used globally to process over 100 million files across 7 regions.",
        "Created Splunk dashboards for real-time analytics, improving visibility and performance tracking.",
        "Implemented CI/CD pipelines for DAG deployment and infrastructure provisioning, reducing manual effort by 70%.",
        "Mentored junior engineers and conducted technical onboarding sessions.",
        "Technologies: Python, Jenkins, Terraform, Apache Airflow, RDS, VPC, EFS, SQS, EC2, S3, CloudWatch."
      ]
    }
  ]
}